tutorials/cases/microTGA/mircoTGATemplate/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
);

regions
(
    boxToCell
    {
        box (-0.002 -0.002 -0.002) (0.002 0.002 0.002);
        fieldValues
        (
            volScalarFieldValue porosityF 0.55 
        );
    }
);


// ************************************************************************* //
